[
    {
        "id": 1,
        "filename": "sasi.png",
        "date": "2025-04-16",
        "structured_text": "**Patient Information:**\n\n* Name: Ms. Sasikala. S\n* Age: 31 \n* Gender: Female (assumed based on title)\n\n**Doctor Information:**\n\n* Name: Dr. M.S. Krishna Meera MD (DVL), EADV \n* Clinic: SKIN & HAIR CLINIC / Reflect Skin & Hair Clinic (appears to have two names based on text)\n* Address: No.2, Ram Lakshman Nagar, Near National Model School, Sowripalayam post, Coimbatore 641028.\n* Phone: +91 422 356 6135 / +91-63801 36936\n* Email: skinreflect@gmail.com\n* Website: www.thereflectclinic.com\n* License Number: 106125 (TNMC)\n* (Also mentioned: Dr. S. Divya MD (DVL) Consultant Dermatologist Regn. No. 112496 (TNMC) - unclear if she's also prescribing)\n\n\n**Medications:**\n\n* Enkor-D sachets: 1 sachet once a day. (Quantity: 10 sachets)\n* Immunore forte: 1 tablet (?) twice a day (assumed based on \"BD\") for 15 days (assumed based on \"xs days\").\n* D. Rusi 60k:  Once weekly for 4 weeks.\n* Avarta antiageing Cream: Apply at night. (Quantity: 30 [units - unclear if g, ml etc.])\n\n\n**Special Instructions:**\n\n* Diagnosis: Oral lichen planus reticulon pattern on one buccal mucosa.  (This is a diagnosis, not an instruction, but relevant information).\n* Date: 18/02/2025 (Presumably the date of the prescription)\n\n**Notes:**\n\n* The prescription is poorly formatted and contains unclear abbreviations.  It's highly recommended Ms. Sasikala clarifies any ambiguities with the prescribing doctor(s).  \"Nueces i] 50+60\" and \"EL Beate Steps Benet oe reflect\" seem to be extraneous text and their meaning is unclear.  \"BD\" is likely meant to be \"twice a day\" but is not standard.  The form of Immunore Forte (tablet, capsule, etc.) is not specified.  The units for Avarta antiageing Cream are missing. It's advisable to confirm the exact dosage instructions for all medications directly with the clinic.",
        "generic_predictions": {}
    },
    {
        "id": 2,
        "filename": "sasi.png",
        "date": "2025-04-16",
        "structured_text": "**Patient Information:**\n\n* Name: Ms. Sasikala. S\n* Age: 31\n* Gender: Female (inferred from title \"Ms.\")\n\n**Doctor Information:**\n\n* Name: Dr. M.S. Krishna Meera MD (DVL), EADV \n* Clinic: SKIN & HAIR CLINIC / Reflect Skin & Hair Clinic (likely the same clinic with abbreviated and full names used)\n* Address: No.2, Ram Lakshman Nagar, Near National Model School, Sowripalayam post, Coimbatore 641028.\n* Phone: +91 422 356 6135 / +91-63801 36936\n* Email: skinreflect@gmail.com\n* Website: www.thereflectclinic.com\n* License Number: 106125 (TNMC) \n\n**(Note: Dr. S. Divya's information is also present, but it appears Ms. Sasikala is Dr. Krishna Meera's patient based on the prescription details.)**\n\n\n**Medications:**\n\n* **Enkor-D sachets:** 1 sachet once a day (for 10 days)\n* **Immunore forte:** 1 tablet twice a day (for 15 days - inferred from \"xs days\" and \"1:00\" likely indicating dosage times)\n* **D. Rusi 60k:**  Once a week (for 4 weeks)\n* **Avarta antiageing Cream:** Apply nightly (for 30 days - assumed based on typical cream supply)\n\n**Special Instructions:**\n\n* Diagnosis: Oral lichen planus reticulon pattern on one buccal mucosa.  (This informs the medication choices but isn't a direct instruction to the patient). \n* None explicitly stated, apart from the medication frequencies. It's possible there were verbal instructions not recorded on the printed prescription.\n\n\n**Unclear Information:**\n\n* \"Nueces i] 50+60\" and \"Bares tide\" – The meaning of these phrases is unclear.  They might be unrelated notes or misinterpretations of handwriting.\n* \"EL Beate Steps Benet oe reflect\"  – This also appears to be a misinterpretation or unrelated text.\n\n\nIt's crucial for patients to clarify any unclear information with their doctor or pharmacist to ensure proper medication usage.",
        "generic_predictions": {}
    }
]